oh-my-fish/theme-bobthefish
oh-my-fish/plugin-brew
brgmnn/fish-docker-compose
fisherman/fzf
belltoy/plugin-mix
tuvistavie/fish-ssh-agent
oh-my-fish/plugin-ssh-config.d
wk/plugin-ssh-term-helper
